Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMinimcds_reg.h
/** \brief 8B8, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT14 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188B8u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT14.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT14.
*/
#define MINIMCDS_MCXACT14 (MINIMCDS_MCX_ACT14)

/** \brief 8BC, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT15 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188BCu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT15.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT15.
*/
#define MINIMCDS_MCXACT15 (MINIMCDS_MCX_ACT15)

/** \brief 8C0, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT16 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188C0u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT16.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT16.
*/
#define MINIMCDS_MCXACT16 (MINIMCDS_MCX_ACT16)

/** \brief 8C4, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT17 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188C4u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT17.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT17.
*/
#define MINIMCDS_MCXACT17 (MINIMCDS_MCX_ACT17)

/** \brief 8C8, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT18 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188C8u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT18.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT18.
*/
#define MINIMCDS_MCXACT18 (MINIMCDS_MCX_ACT18)

/** \brief 8CC, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT19 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188CCu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT19.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT19.
*/
#define MINIMCDS_MCXACT19 (MINIMCDS_MCX_ACT19)

/** \brief 8D0, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT20 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188D0u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT20.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT20.
*/
#define MINIMCDS_MCXACT20 (MINIMCDS_MCX_ACT20)

/** \brief 8D4, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT21 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188D4u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT21.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT21.
*/
#define MINIMCDS_MCXACT21 (MINIMCDS_MCX_ACT21)

/** \brief 8D8, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT22 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188D8u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT22.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT22.
*/
#define MINIMCDS_MCXACT22 (MINIMCDS_MCX_ACT22)

/** \brief 8DC, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT23 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188DCu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT23.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT23.
*/
#define MINIMCDS_MCXACT23 (MINIMCDS_MCX_ACT23)

/** \brief 8E0, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT24 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188E0u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT24.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT24.
*/
#define MINIMCDS_MCXACT24 (MINIMCDS_MCX_ACT24)

/** \brief 8E4, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT25 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188E4u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT25.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT25.
*/
#define MINIMCDS_MCXACT25 (MINIMCDS_MCX_ACT25)

/** \brief 8E8, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT26 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188E8u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT26.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT26.
*/
#define MINIMCDS_MCXACT26 (MINIMCDS_MCX_ACT26)

/** \brief 8EC, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT27 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188ECu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT27.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT27.
*/
#define MINIMCDS_MCXACT27 (MINIMCDS_MCX_ACT27)

/** \brief 8F0, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT28 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188F0u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT28.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT28.
*/
#define MINIMCDS_MCXACT28 (MINIMCDS_MCX_ACT28)

/** \brief 8F4, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT29 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188F4u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT29.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT29.
*/
#define MINIMCDS_MCXACT29 (MINIMCDS_MCX_ACT29)

/** \brief 8F8, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT30 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188F8u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT30.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT30.
*/
#define MINIMCDS_MCXACT30 (MINIMCDS_MCX_ACT30)

/** \brief 8FC, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT31 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB7188FCu)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT31.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT31.
*/
#define MINIMCDS_MCXACT31 (MINIMCDS_MCX_ACT31)

/** \brief 900, Action Definition Register ${x} */
#define MINIMCDS_MCX_ACT32 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MCX_ACT*)0xFB718900u)
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT32.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT32.
*/
#define MINIMCDS_MCXACT32 (MINIMCDS_MCX_ACT32)

