Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMinimcds_reg.h
/** \brief 24A0, Comparator Bound Register ${j} */
#define MINIMCDS_TCX_WD1_BND /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_WD_BND*)0xFB71A4A0u)
/** Alias (User Manual Name) for MINIMCDS_TCX_WD1_BND.
* To use register names with standard convension, please use MINIMCDS_TCX_WD1_BND.
*/
#define MINIMCDS_TCXWDBND1 (MINIMCDS_TCX_WD1_BND)

/** \brief 24A8, Comparator Range Register ${j} */
#define MINIMCDS_TCX_WD1_RNG /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_WD_RNG*)0xFB71A4A8u)
/** Alias (User Manual Name) for MINIMCDS_TCX_WD1_RNG.
* To use register names with standard convension, please use MINIMCDS_TCX_WD1_RNG.
*/
#define MINIMCDS_TCXWDRNG1 (MINIMCDS_TCX_WD1_RNG)

/** \brief 24B0, Comparator Mask Register ${j} */
#define MINIMCDS_TCX_WD1_MSK /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_WD_MSK*)0xFB71A4B0u)
/** Alias (User Manual Name) for MINIMCDS_TCX_WD1_MSK.
* To use register names with standard convension, please use MINIMCDS_TCX_WD1_MSK.
*/
#define MINIMCDS_TCXWDMSK1 (MINIMCDS_TCX_WD1_MSK)

/** \brief 24BC, Comparator Sign Register ${j} */
#define MINIMCDS_TCX_WD1_SGN /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_WD_SGN*)0xFB71A4BCu)
/** Alias (User Manual Name) for MINIMCDS_TCX_WD1_SGN.
* To use register names with standard convension, please use MINIMCDS_TCX_WD1_SGN.
*/
#define MINIMCDS_TCXWDSGN1 (MINIMCDS_TCX_WD1_SGN)

/** \brief 2500, Comparator Bound Register ${j} */
#define MINIMCDS_TCX_AC0_BND /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_AC_BND*)0xFB71A500u)
/** Alias (User Manual Name) for MINIMCDS_TCX_AC0_BND.
* To use register names with standard convension, please use MINIMCDS_TCX_AC0_BND.
*/
#define MINIMCDS_TCXACBND0 (MINIMCDS_TCX_AC0_BND)

/** \brief 2504, Comparator Range Register ${j} */
#define MINIMCDS_TCX_AC0_RNG /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_AC_RNG*)0xFB71A504u)
/** Alias (User Manual Name) for MINIMCDS_TCX_AC0_RNG.
* To use register names with standard convension, please use MINIMCDS_TCX_AC0_RNG.
*/
#define MINIMCDS_TCXACRNG0 (MINIMCDS_TCX_AC0_RNG)

/** \brief 2508, Comparator Mask Register ${j} */
#define MINIMCDS_TCX_AC0_MSK /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_AC_MSK*)0xFB71A508u)
/** Alias (User Manual Name) for MINIMCDS_TCX_AC0_MSK.
* To use register names with standard convension, please use MINIMCDS_TCX_AC0_MSK.
*/
#define MINIMCDS_TCXACMSK0 (MINIMCDS_TCX_AC0_MSK)

/** \brief 2518, Comparator Bound Register ${j} */
#define MINIMCDS_TCX_AC1_BND /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_AC_BND*)0xFB71A518u)
/** Alias (User Manual Name) for MINIMCDS_TCX_AC1_BND.
* To use register names with standard convension, please use MINIMCDS_TCX_AC1_BND.
*/
#define MINIMCDS_TCXACBND1 (MINIMCDS_TCX_AC1_BND)

/** \brief 251C, Comparator Range Register ${j} */
#define MINIMCDS_TCX_AC1_RNG /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_AC_RNG*)0xFB71A51Cu)
/** Alias (User Manual Name) for MINIMCDS_TCX_AC1_RNG.
* To use register names with standard convension, please use MINIMCDS_TCX_AC1_RNG.
*/
#define MINIMCDS_TCXACRNG1 (MINIMCDS_TCX_AC1_RNG)

/** \brief 2520, Comparator Mask Register ${j} */
#define MINIMCDS_TCX_AC1_MSK /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_AC_MSK*)0xFB71A520u)
/** Alias (User Manual Name) for MINIMCDS_TCX_AC1_MSK.
* To use register names with standard convension, please use MINIMCDS_TCX_AC1_MSK.
*/
#define MINIMCDS_TCXACMSK1 (MINIMCDS_TCX_AC1_MSK)

/** \brief 3000, Comparator Bound Register ${j} */
#define MINIMCDS_TCX_IP0_BND /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_IP_BND*)0xFB71B000u)
/** Alias (User Manual Name) for MINIMCDS_TCX_IP0_BND.
* To use register names with standard convension, please use MINIMCDS_TCX_IP0_BND.
*/
#define MINIMCDS_TCXIPBND0 (MINIMCDS_TCX_IP0_BND)

/** \brief 3004, Comparator Range Register ${j} */
#define MINIMCDS_TCX_IP0_RNG /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_IP_RNG*)0xFB71B004u)
/** Alias (User Manual Name) for MINIMCDS_TCX_IP0_RNG.
* To use register names with standard convension, please use MINIMCDS_TCX_IP0_RNG.
*/
#define MINIMCDS_TCXIPRNG0 (MINIMCDS_TCX_IP0_RNG)

/** \brief 3010, Comparator Bound Register ${j} */
#define MINIMCDS_TCX_IP1_BND /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_IP_BND*)0xFB71B010u)
/** Alias (User Manual Name) for MINIMCDS_TCX_IP1_BND.
* To use register names with standard convension, please use MINIMCDS_TCX_IP1_BND.
*/
#define MINIMCDS_TCXIPBND1 (MINIMCDS_TCX_IP1_BND)

/** \brief 3014, Comparator Range Register ${j} */
#define MINIMCDS_TCX_IP1_RNG /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_IP_RNG*)0xFB71B014u)
/** Alias (User Manual Name) for MINIMCDS_TCX_IP1_RNG.
* To use register names with standard convension, please use MINIMCDS_TCX_IP1_RNG.
*/
#define MINIMCDS_TCXIPRNG1 (MINIMCDS_TCX_IP1_RNG)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMINIMCDS_REG_H */
